#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
ci/repo-policy relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/tyk/tyk/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/tyk/tyk

To view this run in a browser, visit:
https://app.terraform.io/app/Tyk/repo-policy-tyk/runs/run-XqkXFoqn7LYbjvq6

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
module.tyk.github_repository.repository: Refreshing state... [id=tyk]
module.tyk.github_branch.default: Refreshing state... [id=tyk:master]
module.tyk.github_branch.release_branches["master"]: Refreshing state... [id=tyk:master]
module.tyk.github_branch.release_branches["release-4.3"]: Refreshing state... [id=tyk:release-4.3]
module.tyk.github_branch.release_branches["release-5-lts"]: Refreshing state... [id=tyk:release-5-lts]
module.tyk.github_branch.release_branches["release-5"]: Refreshing state... [id=tyk:release-5]
module.tyk.github_branch.release_branches["release-4.3.3"]: Refreshing state... [id=tyk:release-4.3.3]
module.tyk.github_branch.release_branches["release-4.0.11"]: Refreshing state... [id=tyk:release-4.0.11]
module.tyk.github_branch.release_branches["release-4.3.2"]: Refreshing state... [id=tyk:release-4.3.2]
module.tyk.github_branch_protection.automerge["release-4.0.10"]: Refreshing state... [id=BPR_kwDOASogO84B4l7t]
module.tyk.github_branch_protection.automerge["master"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNTQ5MzczOA==]
module.tyk.github_branch.release_branches["release-4.3.1"]: Refreshing state... [id=tyk:release-4.3.1]
module.tyk.github_branch_protection.automerge["release-4.3.3"]: Refreshing state... [id=BPR_kwDOASogO84CBpF-]
module.tyk.github_branch_protection.automerge["release-4.3.1"]: Refreshing state... [id=BPR_kwDOASogO84B4l7u]
module.tyk.github_branch.release_branches["release-4.0.12"]: Refreshing state... [id=tyk:release-4.0.12]
module.tyk.github_branch_protection.automerge["release-4.0.11"]: Refreshing state... [id=BPR_kwDOASogO84B-HpU]
module.tyk.github_branch.release_branches["release-4.3.0"]: Refreshing state... [id=tyk:release-4.3.0]
module.tyk.github_branch_protection.automerge["release-5-lts"]: Refreshing state... [id=BPR_kwDOASogO84CEReR]
module.tyk.github_branch.release_branches["release-4.0.10"]: Refreshing state... [id=tyk:release-4.0.10]
module.tyk.github_branch_protection.automerge["release-4.3"]: Refreshing state... [id=BPR_kwDOASogO84B0oVb]
module.tyk.github_branch_protection.automerge["release-4.0.12"]: Refreshing state... [id=BPR_kwDOASogO84CBpF8]
module.tyk.github_branch_protection.automerge["release-5"]: Refreshing state... [id=BPR_kwDOASogO84CEReS]
module.tyk.github_branch_protection.automerge["release-4.3.0"]: Refreshing state... [id=BPR_kwDOASogO84B0oVa]
module.tyk.github_branch_protection.automerge["release-4.3.2"]: Refreshing state... [id=BPR_kwDOASogO84B-HpS]
module.tyk.github_branch_default.default: Refreshing state... [id=tyk]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.tyk.github_branch.release_branches["release-5"] must be replaced
-/+ resource "github_branch" "release_branches" {
      ~ etag          = "W/\"a6467e57361545b9867af52b1b92762e3f215e4d4045a141275ba0512c9c3d4b\"" -> (known after apply)
      ~ id            = "tyk:release-5" -> (known after apply)
      ~ ref           = "refs/heads/release-5" -> (known after apply)
      ~ sha           = "b23b83a0d159458f544e96a81c9af919aabaea9c" -> (known after apply)
      ~ source_branch = "master" -> "main" # forces replacement
      ~ source_sha    = "b23b83a0d159458f544e96a81c9af919aabaea9c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.tyk.github_branch.release_branches["release-5-lts"] must be replaced
-/+ resource "github_branch" "release_branches" {
      ~ etag          = "W/\"069a197467b359c82140317fb67825b6f0283bdf36e24e376795c2f53f2a4ad1\"" -> (known after apply)
      ~ id            = "tyk:release-5-lts" -> (known after apply)
      ~ ref           = "refs/heads/release-5-lts" -> (known after apply)
      ~ sha           = "b23b83a0d159458f544e96a81c9af919aabaea9c" -> (known after apply)
      ~ source_branch = "master" -> "main" # forces replacement
      ~ source_sha    = "b23b83a0d159458f544e96a81c9af919aabaea9c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.


```

</details>

*Pushed by: @ermirizio, Action: `pull_request`*